<abi-corpus path='/code/simple-example/cpp/math-client' architecture='elf-amd-x86_64'>
  <elf-needed>
    <dependency name='libmath-v1.so'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZSt4cout' size='272' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='MathClient.cpp' comp-dir-path='/code/simple-example/cpp' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-3'>
      <subrange length='1' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='160' id='type-id-6'>
      <subrange length='20' type-id='type-id-4' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' id='type-id-8'>
      <subrange length='4' type-id='type-id-4' id='type-id-9'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-13'/>
    <type-decl name='float' size-in-bits='32' id='type-id-14'/>
    <type-decl name='int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-16'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-17'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-18'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-19'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-20'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-21'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-22'/>
    <type-decl name='variadic parameter type' id='type-id-23'/>
    <type-decl name='void' id='type-id-24'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-25'/>
    <typedef-decl name='lldiv_t' type-id='type-id-26' filepath='/usr/include/stdlib.h' line='80' column='1' id='type-id-27'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-27' visibility='default' filepath='/usr/include/stdlib.h' line='77' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-18' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-18' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-11' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-28'/>
    <typedef-decl name='__FILE' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-30'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='245' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-32' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-33' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-22' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-35' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-36' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-37' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='160' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-32' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-33' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='140' column='1' id='type-id-34'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='154' column='1' id='type-id-39'/>
    <typedef-decl name='__off64_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-36'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-37'/>
    <typedef-decl name='mbstate_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-41'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-42' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-40'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-42'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-43'>
          <data-member access='private'>
            <var-decl name='__wch' type-id='type-id-11' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='__wchb' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-45' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-31' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__compar_fn_t' type-id='type-id-47' filepath='/usr/include/stdlib.h' line='805' column='1' id='type-id-48'/>
    <typedef-decl name='div_t' type-id='type-id-49' filepath='/usr/include/stdlib.h' line='62' column='1' id='type-id-50'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-50' visibility='default' filepath='/usr/include/stdlib.h' line='59' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-51' filepath='/usr/include/stdlib.h' line='70' column='1' id='type-id-52'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-52' visibility='default' filepath='/usr/include/stdlib.h' line='67' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-53'/>
    <typedef-decl name='fpos_t' type-id='type-id-54' filepath='/usr/include/stdio.h' line='78' column='1' id='type-id-55'/>
    <typedef-decl name='_G_fpos_t' type-id='type-id-56' filepath='/usr/include/x86_64-linux-gnu/bits/_G_config.h' line='30' column='1' id='type-id-54'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/_G_config.h' line='27' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/_G_config.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/_G_config.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctype_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h' line='38' column='1' id='type-id-57'/>
    <typedef-decl name='wctrans_t' type-id='type-id-58' filepath='/usr/include/wctype.h' line='48' column='1' id='type-id-59'/>
    <typedef-decl name='__int32_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-60'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-63'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-64'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-65'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-67'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-70'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-71'/>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-74'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-76'/>
    <reference-type-def kind='lvalue' type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-78'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-90'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-91'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-97'/>
    <reference-type-def kind='lvalue' type-id='type-id-75' size-in-bits='64' id='type-id-98'/>
    <reference-type-def kind='rvalue' type-id='type-id-75' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <namespace-decl name='std'>
      <class-decl name='integral_constant&lt;bool, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/7/type_traits' line='69' column='1' id='type-id-79'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' filepath='/usr/include/c++/7/type_traits' line='72' column='1' id='type-id-106'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-65' mangled-name='_ZNSt17integral_constantIbLb0EE5valueE' visibility='default' filepath='/usr/include/c++/7/type_traits' line='71' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='operator std::integral_constant&lt;bool, false&gt;::value_type' mangled-name='_ZNKSt17integral_constantIbLb0EEcvbEv' filepath='/usr/include/c++/7/type_traits' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-81' is-artificial='yes'/>
            <return type-id='type-id-106'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt17integral_constantIbLb0EEclEv' filepath='/usr/include/c++/7/type_traits' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-81' is-artificial='yes'/>
            <return type-id='type-id-106'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='integral_constant&lt;bool, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/7/type_traits' line='69' column='1' id='type-id-82'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1' filepath='/usr/include/c++/7/type_traits' line='72' column='1' id='type-id-107'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='value' type-id='type-id-65' mangled-name='_ZNSt17integral_constantIbLb1EE5valueE' visibility='default' filepath='/usr/include/c++/7/type_traits' line='71' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='operator std::integral_constant&lt;bool, true&gt;::value_type' mangled-name='_ZNKSt17integral_constantIbLb1EEcvbEv' filepath='/usr/include/c++/7/type_traits' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-84' is-artificial='yes'/>
            <return type-id='type-id-107'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='operator()' mangled-name='_ZNKSt17integral_constantIbLb1EEclEv' filepath='/usr/include/c++/7/type_traits' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-84' is-artificial='yes'/>
            <return type-id='type-id-107'/>
          </function-decl>
        </member-function>
      </class-decl>
      <namespace-decl name='__exception_ptr'>
        <class-decl name='exception_ptr' size-in-bits='64' visibility='default' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='79' column='1' id='type-id-75'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_exception_object' type-id='type-id-12' visibility='default' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='81' column='1'/>
          </data-member>
          <member-function access='private' constructor='yes'>
            <function-decl name='exception_ptr' mangled-name='_ZNSt15__exception_ptr13exception_ptrC4EPv' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <parameter type-id='type-id-12'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_addref' mangled-name='_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_release' mangled-name='_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes'>
            <function-decl name='_M_get' mangled-name='_ZNKSt15__exception_ptr13exception_ptr6_M_getEv' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-78' is-artificial='yes'/>
              <return type-id='type-id-12'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='exception_ptr' mangled-name='_ZNSt15__exception_ptr13exception_ptrC4Ev' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='exception_ptr' mangled-name='_ZNSt15__exception_ptr13exception_ptrC4ERKS0_' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <parameter type-id='type-id-77'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='exception_ptr' mangled-name='_ZNSt15__exception_ptr13exception_ptrC4EOS0_' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
              <parameter type-id='type-id-99'/>
              <return type-id='type-id-24'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator=' mangled-name='_ZNSt15__exception_ptr13exception_ptraSERKS0_' filepath='/usr/include/c++/7/bits/exception_ptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-100' is-artificial='yes'/>
